#Даны два списка чисел: [1, 2, 6, 4, 5, 7], [10, 2, 3, 4, 8]
#Найдите все числа, которые входят как в первый, так и во второй список и выведите их в порядке возрастания.
ls1 = [1,2,6,4,5,7]
ls2 = [10,2,3,4,8]
print(ls1,ls2)
#ls1.intersection(ls2)
#print(ls1,ls2)
#A = ls1.intersection(ls2)
#ls1.sort(), ls2.sort()
ls1.sort(), ls2.sort()
print(ls1,ls2)
#ls1.sort(), ls2.sort()
