#Определить самый большой элемент списка и заменить им все элементы. Длина списка не больше 5
a = [3,8,5,1,9]

max(a)
print(max(a))
