#Пользователь вводит список чисел через пробел, вывести новый список содержащий только четные элементы
#a = input().split(' ')
print(*(x for x in input().split() if not int(x) % 2))
